20240114160906-understanding_inheritance.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-01-31 Sat 10:07 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Understanding Inheritance</title>
<meta name="author" content="Michael Leibbrandt" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Understanding Inheritance</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org3d1a466">1. Understanding Inheritance</a>
<ul>
<li><a href="#orgd23ef3d">1.1. Example</a></li>
<li><a href="#orgd0ea965">1.2. Transitive</a></li>
<li><a href="#orge5c488a">1.3. Access</a></li>
<li><a href="#orgc08b8fb">1.4. Class Modifiers</a></li>
<li><a href="#orgb5031fc">1.5. Inheriting The Object class</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org3d1a466" class="outline-2">
<h2 id="org3d1a466"><span class="section-number-2">1.</span> Understanding Inheritance</h2>
<div class="outline-text-2" id="text-1">
<p>
<b>Inheritance</b> is the process by which a <code>subclass</code> automatically includes certain members of the class, including primitives, objects, or methods, defined in the <code>parent</code> class.
</p>

<p>
We indicate a class is a <code>subclass</code> by declaring it with the <code>extends</code> keyword
</p>
</div>

<div id="outline-container-orgd23ef3d" class="outline-3">
<h3 id="orgd23ef3d"><span class="section-number-3">1.1.</span> Example</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-java">public class Mammal {} // Superclass
public final class Rhino extends Mammal {} // Subclass
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd0ea965" class="outline-3">
<h3 id="orgd0ea965"><span class="section-number-3">1.2.</span> Transitive</h3>
<div class="outline-text-3" id="text-1-2">
<p>
One key aspect of <b>inheritance</b> is that it is <b>transitive</b>.
</p>

<p>
Given three classes <code>[X, Y, Z]</code>, if <code>X</code> <code>extends</code> <code>Y</code>, and <code>Y</code> <code>extends</code> <code>Z</code>, then <code>X</code> is considered a <code>subclass</code> or <code>descendant</code> of <code>Z</code>.
</p>

<p>
Likewise, <code>Z</code> is a <code>superclass</code> or <code>ancestor</code> of <code>X</code>.
</p>

<p>
We sometimes use the term <b>direct</b> <code>subclass</code> or <code>descendant</code> to indicate the class <b>directly</b> extends the parent class.
For example, <code>X</code> is a <b>direct</b> <code>descendant</code> only of class <code>Y</code>, <b>not</b> <code>Z</code>.
</p>
</div>
</div>

<div id="outline-container-orge5c488a" class="outline-3">
<h3 id="orge5c488a"><span class="section-number-3">1.3.</span> Access</h3>
<div class="outline-text-3" id="text-1-3">
<p>
When one class <b>inherits</b> from a <code>parent</code> class, all <a href="20240113063742-public_access_modifier.html#ID-28127310-6300-4e4f-9935-8c2377e7de75">public</a> and <a href="20240113044720-protected_access_modifier.html#ID-2085746a-5d79-403a-a417-5a0ef14f9933">protected</a> members are automatically available as part of the <code>child</code> class.
</p>

<p>
If the two classes are in the <b>same</b> package, then package members <b>are available</b> to the child class.
</p>

<p>
Last but not least, <a href="20240112061538-private_access_modifier.html#ID-0ea2ebdc-e6b9-405e-be35-ce90462279fe">private</a>  members are restricted to the class they are defined in and are <b>never</b> available via <b>inheritance</b>.
</p>
</div>
</div>
<div id="outline-container-orgc08b8fb" class="outline-3">
<h3 id="orgc08b8fb"><span class="section-number-3">1.4.</span> <a href="20240114165239-class_modifiers.html#ID-0746c442-3534-4076-b43d-0ed51abb8379">Class Modifiers</a></h3>
</div>
<div id="outline-container-orgb5031fc" class="outline-3">
<h3 id="orgb5031fc"><span class="section-number-3">1.5.</span> <a href="20240114163200-inheriting_the_object_class.html#ID-fd832390-4e2b-47c7-8d11-aeaa272a22b6">Inheriting The Object class</a></h3>
</div>
</div>
</div>
</body>
</html>
